

# Python在1989年圣诞节期间被一个荷兰人创造（吉多.范罗苏姆） 
# 于1991年被真正完成
''' 
1 Byte = 8 bit  
1 KB = 1024 B
1 MB = 1024 KB
1 GB = 1024 MB
1 TB = 1024 GB 
'''
# 计算机的语言发展：机器语言-->汇编语言-->高级语言：对人的思维进行模仿，使用易懂的英文进行编程，此时的语言与底层交互不密切，可移植性非常强


#单行注释     单行注释快捷键：Ctrl + /
'''
多行注释
注：
1、注释是给人看的，注释是一种机器不会执行的代码
2、多行注释中不能嵌套多行注释
3、养成做注释的好习惯，且注释要有明确的意义
'''


'''
Python中不能指定变量类型,为变量指定类型会报错
关键字：计算机中已经被定义好的，有特殊含义的单词
标识符：由用户自己定义的有特殊意义的符号
注：
1、标识符不能以数字开头
2、标识符只能由 a-z A-Z 0-9 _ 组成(即字母、数字、下划线)，其它字符都是非法的
    但是严格意义上来说，字母可以是符合unicode编码的任意字符，比如汉字，但是不建议这样做
    这是因为大家都用英文编码，所以字母一般都默认为英文字母
3、Python中严格区分大小写

Python中的命名规范：
1、小驼峰命名规则：helloWorld
2、大驼峰命名规则：HelloWorld
3、下划线命名规则：hello_world
如果是常量则需全部大写
'''